In [ ]:
import psycopg2

# Connect to the default 'postgres' database
conn = psycopg2.connect(
    dbname="postgres",
    user="postgres",
    password="ronak1790",  # <-- your password
    host="localhost",
    port="5432"
)

# Allow CREATE DATABASE outside transaction
conn.autocommit = True

# Create a cursor
cur = conn.cursor()

# Create the new database
cur.execute("CREATE DATABASE food_wastage_management;")

print(" Database 'food_wastage_management' created successfully.")

In [12]:
%reload_ext sql
%sql postgresql://postgres:ronak1790@localhost:5432/postgres

In [13]:
create_tables_sql = """
-- 1. Providers Table
CREATE TABLE IF NOT EXISTS providers_data (
    provider_id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    type VARCHAR(100) NOT NULL,
    address TEXT,
    city VARCHAR(100),
    contact VARCHAR(50)
);

-- 2. Receivers Table
CREATE TABLE IF NOT EXISTS receivers_data (
    receiver_id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    type VARCHAR(100) NOT NULL,
    city VARCHAR(100),
    contact VARCHAR(50)
);

-- 3. Food Listings Table
CREATE TABLE IF NOT EXISTS food_listings_data (
    food_id SERIAL PRIMARY KEY,
    food_name VARCHAR(255) NOT NULL,
    quantity INTEGER CHECK (quantity > 0),
    expiry_date DATE,
    provider_id INT REFERENCES providers_data(provider_id) ON DELETE CASCADE,
    provider_type VARCHAR(100),
    location VARCHAR(100),
    food_type VARCHAR(100),
    meal_type VARCHAR(100)
);

-- 4. Claims Table
CREATE TABLE IF NOT EXISTS claims_data (
    claim_id SERIAL PRIMARY KEY,
    food_id INT REFERENCES food_listings_data(food_id) ON DELETE CASCADE,
    receiver_id INT REFERENCES receivers_data(receiver_id) ON DELETE CASCADE,
    status VARCHAR(50),
    timestamp TIMESTAMP
);
"""

cur.execute(create_tables_sql)
conn.commit()
print(" All tables created successfully.")

 All tables created successfully.

In [13]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

# Adjust the file paths if needed
providers_df = pd.read_csv("providers.csv")
receivers_df = pd.read_csv("receivers.csv")
food_listings_df = pd.read_csv("listings.csv")
claims_df = pd.read_csv("claims.csv")

# Check first few rows
print(providers_df.head())
print(receivers_df.head())
print(food_listings_df.head())
print(claims_df.head())

   Provider_ID                         Name           Type  \
0            1             Gonzales-Cochran    Supermarket
1            2  Nielsen, Johnson and Fuller  Grocery Store
2            3                 Miller-Black    Supermarket
3            4   Clark, Prince and Williams  Grocery Store
4            5               Coleman-Farley  Grocery Store

                                             Address            City  \
0  74347 Christopher Extensions\nAndreamouth, OK ...     New Jessica
1           91228 Hanson Stream\nWelchtown, OR 27136     East Sheena
2  561 Martinez Point Suite 507\nGuzmanchester, W...  Lake Jesusview
3     467 Bell Trail Suite 409\nPort Jesus, IA 61188     Mendezmouth
4  078 Matthew Creek Apt. 319\nSaraborough, MA 53978   Valentineside

                Contact
0       +1-600-220-0480
1  +1-925-283-8901x6297
2      001-517-295-2206
3      556.944.8935x401
4          193.714.6577
   Receiver_ID          Name        Type               City           Contact
0            1  Donald Gomez     Shelter     Port Carlburgh     (955)922-5295
1            2  Laurie Ramos  Individual         Lewisburgh      761.042.1570
2            3  Ashley Mckee         NGO  South Randalltown  691-023-0094x856
3            4    Erika Rose         NGO   South Shaneville        8296491111
4            5   John Romero  Individual          Bakerport      067.491.0154
   Food_ID Food_Name  Quantity Expiry_Date  Provider_ID     Provider_Type  \
0        1     Bread        43   3/17/2025          110     Grocery Store
1        2      Soup        22   3/24/2025          791     Grocery Store
2        3    Fruits        46   3/28/2025          478  Catering Service
3        4    Fruits        15   3/16/2025          930        Restaurant
4        5      Soup        14   3/19/2025          279        Restaurant

           Location       Food_Type  Meal_Type
0  South Kellyville  Non-Vegetarian  Breakfast
1        West James  Non-Vegetarian     Dinner
2       Lake Regina           Vegan  Breakfast
3         Kellytown           Vegan      Lunch
4        Garciaport           Vegan     Dinner
   Claim_ID  Food_ID  Receiver_ID     Status        Timestamp
0         1      164          908    Pending    3/5/2025 5:26
1         2      353          391  Cancelled  3/11/2025 10:24
2         3      626          492  Completed   3/21/2025 0:59
3         4       61          933  Cancelled    3/4/2025 9:08
4         5      345          229    Pending  3/14/2025 15:17

In [14]:
# Example for providers_data
providers_df.columns = providers_df.columns.str.lower().str.replace(' ', '_')

In [89]:
# Convert expiry_date to datetime
food_listings_df['expiry_date'] = pd.to_datetime(food_listings_df['expiry_date'], errors='coerce')

In [90]:
import re

def clean_contact(contact):
    # Keep only digits and '+'
    cleaned = re.sub(r'[^0-9+]', '', str(contact))
    return cleaned

providers_df['contact'] = providers_df['contact'].apply(clean_contact)
receivers_df['contact'] = receivers_df['contact'].apply(clean_contact)

In [91]:
# Example: fill missing quantities with 0
food_listings_df['quantity'] = food_listings_df['quantity'].fillna(0)

# Drop rows with missing provider_id or receiver_id
food_listings_df.dropna(subset=['provider_id'], inplace=True)
claims_df.dropna(subset=['receiver_id', 'food_id'], inplace=True)

In [92]:
providers_df['address'] = providers_df['address'].str.replace('\n', ' ').str.strip()
food_listings_df['food_name'] = food_listings_df['food_name'].str.strip()

In [93]:
providers_df['provider_id'] = providers_df['provider_id'].astype(int)
receivers_df['receiver_id'] = receivers_df['receiver_id'].astype(int)
food_listings_df['quantity'] = food_listings_df['quantity'].astype(int)
claims_df['claim_id'] = claims_df['claim_id'].astype(int)

In [94]:
from sqlalchemy import create_engine

engine = create_engine("postgresql+psycopg2://postgres:ronak1790@localhost:5432/food_wastage_management")

providers_df.to_sql('providers_data', engine, if_exists='replace', index=False)
receivers_df.to_sql('receivers_data', engine, if_exists='replace', index=False)
food_listings_df.to_sql('food_listings_data', engine, if_exists='replace', index=False)
claims_df.to_sql('claims_data', engine, if_exists='replace', index=False)

1000

In [95]:
# Providers
providers_df.rename(columns={
    'Provider_ID': 'provider_id',
    'Name': 'name',
    'Type': 'type',
    'Address': 'address',
    'City': 'city',
    'Contact': 'contact'
}, inplace=True)

# Receivers
receivers_df.rename(columns={
    'Receiver_ID': 'receiver_id',
    'Name': 'name',
    'Type': 'type',
    'City': 'city',
    'Contact': 'contact'
}, inplace=True)

# Food Listings
food_listings_df.rename(columns={
    'Food_ID': 'food_id',
    'Food_Name': 'food_name',
    'Quantity': 'quantity',
    'Expiry_Date': 'expiry_date',
    'Provider_ID': 'provider_id',
    'Provider_Type': 'provider_type',
    'Location': 'location',
    'Food_Type': 'food_type',
    'Meal_Type': 'meal_type'
}, inplace=True)

# Claims
claims_df.rename(columns={
    'Claim_ID': 'claim_id',
    'Food_ID': 'food_id',
    'Receiver_ID': 'receiver_id',
    'Status': 'status',
    'Timestamp': 'timestamp'
}, inplace=True)

1.	How many food providers and receivers are there in each city?

In [98]:
# Providers per city
df_providers_city = pd.read_sql("""
SELECT city, COUNT(provider_id) AS total_providers
FROM providers_data
GROUP BY city
ORDER BY total_providers DESC;
""", engine)

# Receivers per city
df_receivers_city = pd.read_sql("""
SELECT "city", COUNT("receiver_id") AS total_receivers
FROM receivers_data
GROUP BY "city"
ORDER BY total_receivers DESC;
""", engine)

df_receivers_city

df_providers_city.head(), df_receivers_city.head()

(                       city  total_providers
 0                 New Carol                3
 1  South Christopherborough                3
 2               Williamview                2
 3                New Amanda                2
 4              East Melissa                2,
               city  total_receivers
 0  New Christopher                3
 1     Spencermouth                2
 2      Phillipston                2
 3  North Christina                2
 4         Markfurt                2)

2.	Which type of food provider (restaurant, grocery store, etc.) contributes the most food?

In [104]:
df_top_provider_type = pd.read_sql("""
SELECT p."type" AS provider_type, SUM(f."quantity") AS total_food_quantity
FROM food_listings_data f
JOIN providers_data p ON f."provider_id" = p."provider_id"
GROUP BY p."type"
ORDER BY total_food_quantity DESC
LIMIT 1;
""", engine)

df_top_provider_type

  provider_type  total_food_quantity
0    Restaurant               6923.0

3.	What is the contact information of food providers in a specific city?

In [105]:
city_name = 'New Jessica'  # Change as needed
df_providers_contact = pd.read_sql(f"""
SELECT name, contact, type
FROM providers_data
WHERE city = '{city_name}';
""", engine)

df_providers_contact

               name       contact         type
0  Gonzales-Cochran  +16002200480  Supermarket

4.	Which receivers have claimed the most food?

In [108]:
df_top_receivers = pd.read_sql("""
SELECT r."name" AS receiver_name, COUNT(c."claim_id") AS total_claims
FROM claims_data c
JOIN receivers_data r ON c."receiver_id" = r."receiver_id"
GROUP BY r."name"
ORDER BY total_claims DESC
LIMIT 10;
""", engine)

df_top_receivers

       receiver_name  total_claims
0       Matthew Webb             5
1       Scott Hunter             5
2  William Frederick             5
3     Anthony Garcia             5
4         Betty Reid             4
5         Alvin West             4
6    Kristine Martin             4
7    Jennifer Nelson             4
8    Donald Caldwell             4
9    Alexandra Owens             4

5.	What is the total quantity of food available from all providers?

In [111]:
df_total_food = pd.read_sql("""
    SELECT SUM("quantity") AS total_food_available
    FROM food_listings_data;
""", engine)

df_total_food

   total_food_available
0               25794.0

6.	Which city has the highest number of food listings?

In [112]:
df_city_listings = pd.read_sql("""
SELECT Location AS city, COUNT(Food_ID) AS total_listings
FROM food_listings_data
GROUP BY Location
ORDER BY total_listings DESC
LIMIT 1;
""", engine)

df_city_listings

        city  total_listings
0  New Carol               6

7.	What are the most commonly available food types?

In [113]:
df_food_types = pd.read_sql("""
SELECT Food_Type AS food_type, COUNT(Food_ID) AS total
FROM food_listings_data
GROUP BY Food_Type
ORDER BY total DESC
LIMIT 10;
""", engine)

df_food_types

        food_type  total
0      Vegetarian    336
1           Vegan    334
2  Non-Vegetarian    330

8. How many food claims have been made for each food item?

In [115]:
df_claims_food = pd.read_sql("""
SELECT f.Food_Name, COUNT(c.Claim_ID) AS total_claims
FROM claims_data c
JOIN food_listings_data f ON c.Food_ID = f.Food_ID
GROUP BY f.Food_Name
ORDER BY total_claims DESC
LIMIT 10;
""", engine)

df_claims_food

    food_name  total_claims
0        Rice           122
1        Soup           114
2       Dairy           110
3        Fish           108
4       Salad           106
5     Chicken           102
6       Bread            94
7       Pasta            87
8  Vegetables            86
9      Fruits            71

9. Which provider has had the highest number of successful food claims?

In [116]:
df_top_provider_claims = pd.read_sql("""
SELECT p.name AS provider_name, COUNT(c.Claim_ID) AS successful_claims
FROM claims_data c
JOIN food_listings_data f ON c.Food_ID = f.Food_ID
JOIN providers_data p ON f.Provider_ID = p.provider_id
WHERE c.Status = 'Completed'
GROUP BY p.name
ORDER BY successful_claims DESC
LIMIT 1;
""", engine)

df_top_provider_claims

  provider_name  successful_claims
0   Barry Group                  5

10. What percentage of food claims are completed vs. pending vs. canceled?

In [117]:
df_claims_status = pd.read_sql("""
SELECT c.Status,
       COUNT(*) AS count,
       ROUND(100.0 * COUNT(*) / (SELECT COUNT(*) FROM claims_data), 2) AS percentage
FROM claims_data c
GROUP BY c.Status;
""", engine)

df_claims_status

      status  count  percentage
0  Completed    339        33.9
1  Cancelled    336        33.6
2    Pending    325        32.5

11. What is the average quantity of food claimed per receiver?

In [118]:
df_avg_claim_per_receiver = pd.read_sql("""
SELECT r.Name AS receiver_name,
       ROUND(AVG(f.Quantity), 2) AS avg_quantity_claimed
FROM claims_data c
JOIN receivers_data r ON c.Receiver_ID = r.Receiver_ID
JOIN food_listings_data f ON c.Food_ID = f.Food_ID
GROUP BY r.Name
ORDER BY avg_quantity_claimed DESC
LIMIT 10;
""", engine)

df_avg_claim_per_receiver

        receiver_name  avg_quantity_claimed
0         Nancy Silva                  50.0
1          Lisa Pitts                  50.0
2  Christopher Wright                  50.0
3     Daniel Williams                  50.0
4   Thomas Villanueva                  50.0
5        Peggy Knight                  50.0
6         Nancy Jones                  50.0
7         Angel Adams                  49.0
8   Alexander Mullins                  49.0
9     Cassandra Yoder                  49.0

12. Which meal type (breakfast, lunch, dinner, snacks) is claimed the most?

In [119]:
df_meal_type = pd.read_sql("""
SELECT f.Meal_Type, 
       COUNT(c.Claim_ID) AS total_claims
FROM claims_data c
JOIN food_listings_data f ON c.Food_ID = f.Food_ID
GROUP BY f.Meal_Type
ORDER BY total_claims DESC;
""", engine)

df_meal_type

   meal_type  total_claims
0  Breakfast           278
1      Lunch           250
2     Snacks           240
3     Dinner           232

13.	What is the total quantity of food donated by each provider?

In [120]:
df_total_donated = pd.read_sql("""
SELECT p.name AS provider_name, 
       SUM(f.Quantity) AS total_donated
FROM food_listings_data f
JOIN providers_data p 
     ON f.Provider_ID = p.provider_id
GROUP BY p.name
ORDER BY total_donated DESC
LIMIT 10;
""", engine)

df_total_donated

                provider_name  total_donated
0                  Miller Inc          217.0
1                 Barry Group          179.0
2  Evans, Wright and Mitchell          158.0
3                 Smith Group          150.0
4                Campbell LLC          145.0
5                  Nelson LLC          142.0
6                  Ruiz-Oneal          140.0
7           Blankenship-Lewis          124.0
8                  Kelly-Ware          123.0
9           Bradford-Martinez          121.0

14: Which provider contributes the highest number of distinct food items?

In [121]:
df_provider_food_count = pd.read_sql("""
SELECT p.name AS provider_name, 
       COUNT(DISTINCT f.Food_Name) AS distinct_food_items
FROM food_listings_data f
JOIN providers_data p 
     ON f.Provider_ID = p.provider_id
GROUP BY p.name
ORDER BY distinct_food_items DESC
LIMIT 10;
""", engine)

df_provider_food_count

       provider_name  distinct_food_items
0       Campbell LLC                    6
1         Miller Inc                    6
2        Daniels-Kim                    5
3  Butler-Richardson                    4
4        Moore Group                    4
5            Cox LLC                    4
6         Wright LLC                    4
7          Brown Ltd                    3
8  Blankenship-Lewis                    3
9  Aguilar-Frederick                    3

15: Which receiver claims the most variety of food types?

In [122]:
df_receiver_food_variety = pd.read_sql("""
SELECT r.Name AS receiver_name, 
       COUNT(DISTINCT f.Meal_Type) AS food_type_variety
FROM claims_data c
JOIN receivers_data r 
     ON c.Receiver_ID = r.Receiver_ID
JOIN food_listings_data f 
     ON c.Food_ID = f.Food_ID
GROUP BY r.Name
ORDER BY food_type_variety DESC
LIMIT 10;
""", engine)

df_receiver_food_variety

        receiver_name  food_type_variety
0   William Frederick                  4
1       Ashley Harris                  3
2    Abigail Crawford                  3
3       Alicia Porter                  3
4          Adam Moore                  3
5      Anthony Garcia                  3
6     Alexandra Owens                  3
7     Alexander Walsh                  3
8    Alexandra Rogers                  3
9  Allison Pennington                  3

16: Number of providers by type

In [123]:
df_provider_type_count = pd.read_sql("""
SELECT type AS provider_type, COUNT(*) AS total_providers
FROM providers_data
GROUP BY type
ORDER BY total_providers DESC;
""", engine)
df_provider_type_count

      provider_type  total_providers
0       Supermarket              262
1     Grocery Store              256
2        Restaurant              246
3  Catering Service              236

17: Top 10 food items by total quantity available

In [124]:
df_top_food_quantity = pd.read_sql("""
SELECT f.Meal_Type AS food_name, 
       SUM(f.Quantity) AS total_quantity
FROM food_listings_data f
GROUP BY f.Meal_Type
ORDER BY total_quantity DESC
LIMIT 10;
""", engine)

df_top_food_quantity

   food_name  total_quantity
0     Snacks          6693.0
1  Breakfast          6667.0
2      Lunch          6373.0
3     Dinner          6061.0

18: Average quantity per food type

In [125]:
df_avg_quantity_food_type = pd.read_sql("""
SELECT Food_Type, ROUND(AVG(Quantity), 2) AS avg_quantity
FROM food_listings_data
GROUP BY Food_Type
ORDER BY avg_quantity DESC;
""", engine)

df_avg_quantity_food_type

        food_type  avg_quantity
0           Vegan         26.34
1  Non-Vegetarian         26.23
2      Vegetarian         24.82

19: Number of food items expiring in the next 7 days

In [127]:
df_expiring_soon = pd.read_sql("""
SELECT "food_name", "quantity", "expiry_date"
FROM food_listings_data
WHERE "expiry_date" <= CURRENT_DATE + INTERVAL '7 days'
ORDER BY "expiry_date" ASC;
""", engine)

df_expiring_soon

    food_name  quantity expiry_date
0       Salad        32  2025-03-16
1     Chicken        18  2025-03-16
2        Rice         1  2025-03-16
3       Salad        43  2025-03-16
4       Salad         1  2025-03-16
..        ...       ...         ...
995    Fruits        42  2025-03-30
996      Rice         4  2025-03-30
997      Fish        26  2025-03-30
998      Rice        28  2025-03-30
999      Rice        42  2025-03-30

[1000 rows x 3 columns]

20: Top 10 food items claimed the most

In [128]:
df_top_claimed_food = pd.read_sql("""
SELECT f.Food_Name, COUNT(c.Claim_ID) AS total_claims
FROM claims_data c
JOIN food_listings_data f ON c.Food_ID = f.Food_ID
GROUP BY f.Food_Name
ORDER BY total_claims DESC
LIMIT 10;
""", engine)

df_top_claimed_food

    food_name  total_claims
0        Rice           122
1        Soup           114
2       Dairy           110
3        Fish           108
4       Salad           106
5     Chicken           102
6       Bread            94
7       Pasta            87
8  Vegetables            86
9      Fruits            71

21: Claims by city

In [129]:
df_claims_city = pd.read_sql("""
SELECT f.Location AS city, COUNT(c.Claim_ID) AS total_claims
FROM claims_data c
JOIN food_listings_data f ON c.Food_ID = f.Food_ID
GROUP BY f.Location
ORDER BY total_claims DESC;
""", engine)

df_claims_city

                 city  total_claims
0    East Heatherport            12
1    Lake Andrewmouth             9
2           Jamesfurt             9
3           East John             7
4       South Kathryn             7
..                ...           ...
463          Bellport             1
464      Port Melanie             1
465        Spenceland             1
466    North Garybury             1
467          Westbury             1

[468 rows x 2 columns]

22: Claims success rate per provider

In [ ]:
df_claims_success_rate = pd.read_sql("""
SELECT p.name AS provider_name,
       COUNT(CASE WHEN c.Status = 'Completed' THEN 1 END)::float / COUNT(c.Claim_ID) * 100 AS success_rate
FROM claims_data c
JOIN food_listings_data f ON c.Food_ID = f.Food_ID
JOIN providers_data p ON f.Provider_ID = p.provider_id
GROUP BY p.name
ORDER BY success_rate DESC
LIMIT 10;
""", engine)

df_claims_success_rate

                  provider_name  success_rate
0  Petersen, Morrison and Woods         100.0
1              Arroyo-Henderson         100.0
2     Hodge, Lee and Washington         100.0
3                 Douglas-Colon         100.0
4                   Oconnor Ltd         100.0
5               Jones-Patterson         100.0
6    Jones, Calderon and Finley         100.0
7                  Townsend Inc         100.0
8                  Hall-Barnett         100.0
9    Wolfe, Hull and Richardson         100.0

23: Most claimed meal type per city

In [130]:
df_meal_city = pd.read_sql("""
SELECT f.Location AS city, f.Meal_Type AS meal_type, COUNT(c.Claim_ID) AS total_claims
FROM claims_data c
JOIN food_listings_data f ON c.Food_ID = f.Food_ID
GROUP BY f.Location, f.Meal_Type
ORDER BY total_claims DESC;
""", engine)

df_meal_city

                 city  meal_type  total_claims
0    East Heatherport  Breakfast             8
1           New Carol     Snacks             6
2           Anneville      Lunch             5
3    Lake Andrewmouth     Snacks             5
4           Jamesfurt      Lunch             5
..                ...        ...           ...
582    North Nicholas     Snacks             1
583        Joneshaven      Lunch             1
584         New Larry     Snacks             1
585        Brookeland     Dinner             1
586      Boylechester      Lunch             1

[587 rows x 3 columns]

24: Total quantity claimed vs. total quantity available per provider

In [131]:
df_claim_vs_available = pd.read_sql("""
SELECT p.name AS provider_name,
       SUM(f.Quantity) AS total_available,
       SUM(CASE WHEN c.Status = 'Completed' THEN f.Quantity ELSE 0 END) AS total_claimed
FROM food_listings_data f
LEFT JOIN claims_data c ON f.Food_ID = c.Food_ID
JOIN providers_data p ON f.Provider_ID = p.provider_id
GROUP BY p.name
ORDER BY total_claimed DESC
LIMIT 10;
""", engine)

df_claim_vs_available

                  provider_name  total_available  total_claimed
0                   Barry Group            307.0          140.0
1             Butler-Richardson            365.0          129.0
2                    Nelson LLC            334.0          123.0
3                 Rogers-Warren            299.0          108.0
4                    Rowe-Arias            123.0           98.0
5                    Miller Inc            267.0           94.0
6             Bradford-Martinez            196.0           94.0
7  Hunter, Ballard and Caldwell            193.0           92.0
8                   Flores-Wade            142.0           92.0
9                  Atkins Group             92.0           92.0

25: Top 5 cities with most food donations

In [132]:
df_top_donation_cities = pd.read_sql("""
SELECT Location AS city, SUM(Quantity) AS total_donated
FROM food_listings_data
GROUP BY Location
ORDER BY total_donated DESC
LIMIT 5;
""", engine)

df_top_donation_cities

            city  total_donated
0  South Kathryn          179.0
1   Jonathanstad          169.0
2      New Carol          167.0
3    North Keith          158.0
4      Jimmyberg          150.0

In [133]:
import pandas as pd
from sqlalchemy import create_engine

# replace with your connection string
engine = create_engine("postgresql+psycopg2://postgres:ronak1790@localhost/food_wastage_management")

# check columns
pd.read_sql("SELECT * FROM food_listings_data LIMIT 1;", engine).columns.tolist()

['food_id',
 'food_name',
 'quantity',
 'expiry_date',
 'provider_id',
 'provider_type',
 'location',
 'food_type',
 'meal_type']